{
    "id": "magical-glass",
    "authors": [
        "Nyakorita",
        "Sam Deluxe",
        "Bor",
        "Just Another Random User"
    ],
    "version": "v1.1.0",
    "engineVer": "v0.9.0-dev",

    "config": {
        ///// Default battle system
        // If an encounter isn't forcing a battle system, use this system as a fallback.
        ///// Values:
        // "undertale"
        // "deltarune"
        /////
        "default_battle_system": "undertale",

        ///// Light Battle TP
        // Whether the Tension Bar and grazing should be enabled in light battles.
        /////
        "light_battle_tp": false,

        ///// Force light mode in Light Battles
        // Whether the game should enable light mode when entering a light battle in the dark world.
        /////
        "force_light_mode_in_light_battles": false,

        ///// UNDERTALE text skipping
        // Disables skipping text in ANY textbox when holding down confirm or menu.
        /////
        "undertale_text_skipping": true,

        ///// Ball of Junk
        // Whether the dark inventory should be stored in a flag rather than
        // the Ball of Junk item during Dark to Light item conversion.
        /////
        "ball_of_junk": false,

        ///// Hide CELL option in the Light World menu
        // Hides the CELL option in the Light World menu if the has_cell_phone flag is false.
        /////
        "hide_cell": true,

        ///// Light World STAT menu style
        // Determines the appearance of the Light World STAT menu when more than one character is
        // in the party.
        ///// Values:
        //
        // "magical_glass"
        // Prints all 3 members' names without quotation marks at the top of the box with their portrait (if they have one)
        // in the empty space across from LV and HP. A Soul is placed above their names to act
        // as the cursor.
        // (This option only supports up to 3 party members.)
        //
        // "deltatraveler"
        // The Light World STAT menu from Deltatraveler. Only shows the currently selected member's
        // name and portrait, with an indicator underneath the portrait showing you can press left
        // or right to select a character.
        // (This option supports any amount of party members.)
        //
        /////
        "light_stat_menu_style": "magical_glass",

        ///// UNDERTALE stat display
        // Subtracts 10 from base AT and DF in the Light World's STAT menu.
        /////
        "undertale_stat_display": true,

        ///// Always show magic
        // Whether the MG stat should always be shown in the Light World STAT menu.
        ///// Values:
        //
        // true
        // Always shows the MG stat.
        //
        // false
        // Only shows the MG stat if it's greater than 0.
        //
        /////
        "always_show_magic": false,

        ///// Gauge style
        // Determines the appearance of gauges drawn in ENEMYSELECT or PARTYSELECT in Light Battles.
        ///// Values:
        //
        // "undertale"
        // UNDERTALE-styled HP gauges.
        // This style does not support mercy bars.
        //
        // "deltarune"
        // deltarune-styled HP and Mercy gauges.
        // Supports mercyBar and enemyBarPercentages.
        //
        /////
        "gauge_style": "undertale",

        ///// Mercy Bar
        // Draws the Mercy Bar in Light Battles if gauge_style is set to deltarune.
        // Works identically to the mercyBar mod config option.
        /////
        "mercy_bar": false,

        ///// Enemy Bar Percentages
        // Draws the HP and Mercy text and Percentages on the gauges in ENEMYSELECT if gauge_style is set to deltarune.
        // Works identically to the enemyBarPercentages mod config option.
        /////
        "enemy_bar_percentages": false,

        ///// Action Button flash
        // Whether the Spell and Mercy buttons should flash in Light Battles if an enemy is pacifyable or sparable.
        /////
        "action_button_flash": false,
    }
}